Revit 2024 API
AssemblyMemberDifferentType Properties
The AssemblyMemberDifferentType type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from AssemblyMemberDifference.)
TypeId1
 Type id of the first assembly member
TypeId2
 Type id of the second assembly member
See Also
AssemblyMemberDifferentType Class
Autodesk.Revit.DB Namespace